#просим пользователя ввести каждое значение по отдельности 
b = float(input("Введите первый элемент прогрессии:"))
q = float(input("Введите множитель прогрессии:"))
n = int(input("Введите номер последнего элемента:"))
#вводим условия, заданные условием задачи 
if b>=-10000 and b<=10000:
    if q<=50 and q>=1:
       if n>=2 and n<=100:
          #формула расчета геометрической прогрессии 
          k = b * (1 - q**n) / (1 - q)
          #выводим эту прогрессию на экран 
          print ("Геометрическая прогрессия",k)
       #вводим условие для числа, если оно не подходит изначальным условиям задачи     
       else:
           #выводим на экран 
          print ("Число не подходит, введите другое")
    #вводим условие для множителя равному 1       
    elif q==1: 
        #и при этом все остальные условия должны выполняться 
        if n>=2 and n<=100:
            #формула для расчета прогрессии при q=1
            k = b * n
            #выводим на экран 
            print("Геометрическая прогрессия",k)
        #условия вывода на экран, если числа не соответствуют заданным условиям     
        else: print ("Число не подходит, введите другое")
    else: print ("Число не подходит, введите другое")
else: print ("Число не подходит, введите другое")

