
# Просим пользователя ввести каждое значение по отдельности 

b = float(input("Введите первый элемент прогрессии:"))
q = float(input("Введите множитель прогрессии:"))
n = int(input("Введите номер последнего элемента:"))
if b>=-10000 and b<=10000:
    if q<=50 and q>=1:
       if n>=2 and n<=100:
          k = b * (1 - q**n) / (1 - q)
          print ("Геометрическая прогрессия",k)
       else:
          print ("Число не подходит, введите другое")
    elif q==1: 
        if n>=2 and n<=100:
            k = b * n
            print("Геометрическая прогрессия",k)
        else: print ("Число не подходит, введите другое")
    else: print ("Число не подходит, введите другое")
else: print ("Число не подходит, введите другое")

