#счетчик операций
op = 0
#вводим число
n = int(input('Введите число:'))
#условие для n
if n >= 1 and n <= 100000:
    #цикл, когда n>0
    while n > 0:
        #если остаток от деления на 3 сравним с 0, то отнимаем 3
        if(n % 3 == 0):
            n -= 3
         #если остаток от деления на 3 сравним с 1, то отнимаем 1
        elif(n % 3 == 1):
            n -= 1
         #если остаток от деления на 3 сравним с 2, то отнимаем 2
        elif(n % 3 == 2):
            n -= 2
         #добавляем операцию
        op += 1
        #цикл продолжает работу, пока выполняется условие
    #выводим количество операций
    print('Количество операция:', op)
