#просим пользователя ввывести любое число 
n = int(input())
#вводим наше условие, что число может быть в определенном диапозоне 
if n>=1 and n<=25:
   #вводим условие для числа 1, которое не является ни простым, ни составным  
   if n==1: print ("N")
   #вводим условие для простого числа 
   elif n == 2 or n == 3 or n == 5 or n == 7 or n == 11 or n == 13 or n == 17 or n == 19 or n == 23: print("Y")   
 #если число в диапазоне, но не в списке простых-значит оно составное
   else: print("N")
else: print ("Число не подходит, введите другое")
