#вводим число
n = int(input('Введите целое число от 1 до 25 включительно, чтобы узнать простое оно или нет: '))
#проверяем условия(1 ни то, ни другое; 2 3 5 простые)
if n == 1 :
# выводим на экран
    print("число ни простое, ни составное")
# если  n при делении на 2 сравнимо с 0 и  n больше 2, то составное
elif n%2 == 0 and n > 2 :
# выводим на экран составное число
     print("N")
# если  n при делении на 3 сравнимо с 0 и  n больше 3, то составное
elif n%3 == 0 and n > 3 :
# выводим на экран составное число
    print("N")
# если  n при делении на 5 сравнимо с 0 и  n больше 5, то составное
elif n%5 == 0 and n > 5 :
# выводим на экран составное число
     print("N")
# в остальных случаях число простое
else :
# выводим на экран простое число 
    print("Y")
